---
type: OptionalFunctionalityUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 18
tags: [revit-api, class]
---

# OptionalFunctionalityUtils

`Autodesk.Revit.DB.OptionalFunctionalityUtils` · Revit 2024 · 18 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Is3DMImportLinkAvailable | 2022 | `public static bool Is3DMImportLinkAvailable ()` |
| Method | IsAXMImportLinkAvailable | 2022.1 | `public static bool IsAXMImportLinkAvailable ()` |
| Method | IsDGNExportAvailable | — | `public static bool IsDGNExportAvailable ()` |
| Method | IsDGNImportLinkAvailable | — | `public static bool IsDGNImportLinkAvailable ()` |
| Method | IsDWFExportAvailable | — | `public static bool IsDWFExportAvailable ()` |
| Method | IsDWGExportAvailable | — | `public static bool IsDWGExportAvailable ()` |
| Method | IsDWGImportLinkAvailable | — | `public static bool IsDWGImportLinkAvailable ()` |
| Method | IsDXFExportAvailable | — | `public static bool IsDXFExportAvailable ()` |
| Method | IsFBXExportAvailable | — | `public static bool IsFBXExportAvailable ()` |
| Method | IsGraphicsAvailable | — | `public static bool IsGraphicsAvailable ()` |
| Method | IsIFCAvailable | 2014 | `public static bool IsIFCAvailable ()` |
| Method | IsNavisworksExporterAvailable | 2014 | `public static bool IsNavisworksExporterAvailable ()` |
| Method | IsOBJImportLinkAvailable | 2022.1 | `public static bool IsOBJImportLinkAvailable ()` |
| Method | IsPDFImportAvailable | 2020 | `[ ObsoleteAttribute ("This method is deprecated in Revit 2024 because it will always return true. It will be removed in a future version of Revit")] public static bool IsPDFImportAvailable ()` |
| Method | IsSATImportLinkAvailable | 2014 | `public static bool IsSATImportLinkAvailable ()` |
| Method | IsSKPImportLinkAvailable | 2014 | `public static bool IsSKPImportLinkAvailable ()` |
| Method | IsSTLImportLinkAvailable | 2022.1 | `public static bool IsSTLImportLinkAvailable ()` |
| Method | IsShapeImporterAvailable | 2016 | `public static bool IsShapeImporterAvailable ()` |